{
  "job_description": "Job Title: Embedded Systems Engineer\nWe are looking for a motivated Embedded Engineer to design, develop, and test firmware for microcontroller-based systems. \nThe ideal candidate has solid experience in C/C++, real-time systems, and low-level driver development. \nYou'll work closely with hardware and software teams to bring innovative embedded solutions to life.\n\nRequirements:\n\nProficiency in C/C++ for embedded systems\n\nExperience with microcontrollers (e.g., STM32, NXP)\n\nKnowledge of communication protocols (UART, SPI, I2C, CAN)\n\nFamiliarity with RTOS or bare-metal programming\n\nNice to have: Python, embedded Linux, CI/CD tools, automotive or IoT experience.\n\n",
  "cvs": [
    {
      "name": "CV-Nada-Ben-Ouahada",
      "text": "Nada Ben Ouahada \nAnalyste des tests QA et de \nl’automatisation \nAdresse: Tunis, Tunisie \nTel: +216 92 888 966 \nMail: \nnada.benouahada@esprit.tn \nLinkedin: \nlinkedin.com/in/nada-ben-\nwahada-476893190/ \n \nOBJECTIF PROFESSIONNEL   \n \nIngénieure en Assurance Qualité (QA) spécialisée dans l'automatisation, je suis enthousiaste à l'idée de \ndécouvrir de nouvelles opportunités professionnelles enrichissantes. Forte de plus de 4 ans d'expérience \ndans le domaine de l'automatisation des tests, j'ai développé une expertise avérée dans la conception, \nle développement et la mise en œuvre de stratégies de test.   \n \nCOMPÉTENCES \n \nOutils d'automatisation: Cypress, Selenium WebDriver, Gherkin, SoapUI, Postman  \nTest Manuel/ Fonctionnel  \nLangages de programmation: TypeScript, JavaScript, SQL, Java  \nFramework: Angular, Spring Boot  \nOutils & IDE: Git, JIRA, Confluence, GitLab, Azure Devops, Eclipse, VS Code, STS, Zephyr Test \nMéthodologies: Agile (Scrum)  \nEnvironnements: Windows \n \nEXPÉRIENCE PROFESSIONELLE \n \nQA Automation Tester – Agoragroup | Tunis \nSeptembre 2024 - Présent \n• \nConcevoir et rédiger les plans de test pour garantir une couverture de test complète des \nfonctionnalités. \n• \nÉlaborer des scénarios et cas de test détaillés pour chaque nouvelle évolution \ndu produit. \n• \nPréparer des jeux de données spécifiques pour les différents types de tests. \n• \nMener les tests manuels et fonctionnels pour valider chaque évolution et \ncorriger les anomalies résolues, tout en assurant les tests de non-régression. \n• \nTravailler en étroite collaboration avec les développeurs et business analysts \npour clarifier les exigences, en garantissant leur testabilité, cohérence et \nexhaustivité. \n• \nIdentifier et documenter les anomalies dans Azure DevOps en créant des \ntickets détaillés. \n• \nIntégrer Cypress pour l'automatisation des tests sur l'application web. \n• \nRédiger des scripts de test automatisés avec Cypress pour améliorer la \ncouverture et l'efficacité des tests. \n• \nIntégrer les tests automatisés dans les pipelines CI/CD dans Azure DevOps. \n• \nOptimiser et maintenir les suites de tests automatisés en tenant compte des \névolutions de l’application, tout en assurant une exécution fluide et fiable des \ntests dans l’environnement de CI/CD. \n \nAnalyste des tests QA et de l’Automatisation – Vermeg | Tunis  \nOctobre 2020 – Août 2024 \n• \nRédiger des scripts automatisés et exécuter des scénarios de test, atteignant ainsi une \ncouverture de 95% des scénarios de test, que ce soit pour les nouvelles évolutions ou \nles anomalies résolues. \n• \nMettre en œuvre des tests automatisés à l'aide de l'outil d'automatisation des tests \n(Cypress). \n• \nAnalyser les résultats des tests. \n• \nExécuter les tests manuels/fonctionnels des évolutions ainsi que des anomalies \nrésolues, et effectuer les tests de non-régression. \n• \nCollaborer activement avec les développeurs pour clarifier les exigences, notamment en \ntermes de testabilité, de cohérence et d'exhaustivité. \n• \nIdentifier les anomalies et rédiger des tickets JIRA. \n• \nCréer et exécuter des scénarios de tests avec Zephyr. \n• \nRédiger des plans de tests pour garantir une couverture complète. \n• \nAssurer la validation de la release/patch avant son déploiement. \n• \nParticiper au design technique et rédiger des documents techniques.  \n \nStage de fin d’études – Picosoft | Tunis  \nFévrier 2020 – Juillet 2020 \n• \nConception et développement d'une application Web destinée à gérer la présence et \nl'absence des employés en utilisant les technologies Spring Boot et Angular. \n \nStage d’été – Sotetel | Tunis  \nJuillet 2019 – Août 2019 \n• \nConception et création d'un module de gestion commerciale intégré dans Odoo version \n11 en utilisant les langages de programmation Python et XML. \n \nDIPLÔMES ET FORMATION \n \nDiplôme d’ingénieur en Informatique \nDepuis septembre 2020 à Juin 2024  \nEcole Supérieure Privée d'Ingénierie et de Technologies – ESPRIT | Tunis  \n \nLicence en informatique appliquée à la gestion  \nDe septembre 2017 à juillet 2020  \nEcole supérieure de l’économie numérique | Manouba \n \n \nCERTIFICATIONS \n \nA4Q Selenium 4 Tester 2.0 \n \nLANGUES \n \nAnglais ( Courant ) \nFrançais ( Courant ) \nArabe ( Native )  \n \n"
    },
    {
      "name": "Ghaith BenHaj CV",
      "text": "Ghaith BenHaj\n (+216)97132477\n# ghaith.benhaj@gmail.com\nï linkedin.com/in/ghaith-benhaj-29403a18a/\n§ github.com/kAif-gh\nEducation\nNational Engineering School of Tunis (ENIT)\nBachelor of Science in Computer Science\nTunis, Tunisia\nNational Engineering School of Tunis (ENIT), University of Paris City\nDouble Master’s Degree Information Processing and Complexity of Life\nTunis, Tunisia / Paris, France\nCertificats\n• Azure Fundamentals from Microsoft\n• Certified Kubernetes Administrator CKA\n• Machine Learning from Stanford University, Coursera\n• Python for Data Science, AI Development from IBM\nWork Experience\nEquinor\n06/2024 – Present\nConsultant Data Engineer\nTunis, Tunisia\n• Orchestrated an end-to-end pipeline to update data across systems, leveraging MinIO for backfilling data (processing\nover 10 TB of historical data), Redis for real-time updates (reducing data retrieval latency by 35%), Kafka for\nstreaming topic publishing (handling 500,000 messages per day), and DeltaTables on Azure for data insertion and\nupdates (improving data availability by 20%). All steps were seamlessly orchestrated and deployed using ArgoCD\nWorkflows, reducing deployment time by 40%.\n• Built Argo Workflows to automate Spark jobs, filtering data based on predefined conditions, which enhanced processing\nefficiency by 40% and reduced manual intervention by 10 hours per week.\n• Implemented a Kafka-based data streaming pipeline that processed 10 GB/day of JSON data, transforming it into a\nformat optimized for GraphQL queries. This solution reduced query response times by 25% and increased system\nthroughput to support 100,000 requests per hour.\nSambacLab\n09/2023 – 05/2024\nSoftware & Data Engineer\nTunis, Tunisia\n• Improved system efficiency by replacing Spark Jobs with Rust-based implementation, cutting resource usage by 23%\nand boosting performance and cost-effectiveness.\n• Created a robust Data Conflict Resolution system for a Collaborative App, employing a multiplayer approach with\nRust to uphold data integrity and enhance user experience, reducing conflict instances by 30%.\n• Constructed a streamlined data ingestion process for extracting and loading data into Deltalake, optimizing the\nperformance of the collaborative app, resulting in a 40% increase in data processing speed.\nProjects\nProfit Boosting via Traffic Prediction In Value Digital Services | PySpark, Python, Scrapy\n02/2023 – 09/2023\n• Spearheaded the development of a Dashboard and a Deep Learning model using Graph Data, optimizing\n”Advertising Boards” placement and boosting marketing profits by 10% with 85% prediction accuracy.\n• Engineered an end-to-end ETL Pipeline for Tunisian Traffic Time Series data, scrapping, transforming and storing it in a\nGraph Database, reducing data processing time by 42%.\nViolence Detection in Tunisian Surveillance Cameras | Python, Selenium, Machine Learning\n03/2023 – 04/2023\n• Designed a sophisticated model leveraging computer vision techniques to identify instances of violence in surveillance\ncamera footage, reaching a precision of 84%\n• Developed a customized web scraping solution to collect video data categorized with instances of violence, serving as\nvaluable training data for machine learning models, resulting in a dataset of over 13,000 labeled instances.\nTechnical Skills\nLanguages: Python, Java, Scala, PySpark, SQL, PostgreSQL, Rust, Bash\nTools/Technologies/Frameworks: Git, Docker, Kubernetes, Terraform, ArgoCD, Azure, Oracle, BigQuery, Airflow,\nDeltaLake, Databricks, Kafka, Spark, Grafana, Pandas, Plotly\nLanguages\nFrench: Level B2\nEnglish: Level C1\n"
    },
    {
      "name": "Nouha Ben Ouahada CV",
      "text": "Nouha Ben Ouahada\nTunis, Tunisia\nÓ (+216)92888933\nR nouhawahada@gmail.com\n¯ linkedin.com/in/nouha-ben-ouahada-a1593219b\nEducation\nFacult´e des Sciences de Tunis (FST)\n09/2019 - 06/2022\nLicence en ing´enerie des syst`emes informatiques\nTunis, Tunisia\n´Ecole sup´erieure priv´ee d’ing´enierie et de technologie (ESPRIT)\n09/2022 – Pr´esent\nIng´enierie en g´enie logiciel , sp´ecialit´e systeme embarqu´e\nTunis, Tunisia\nCertificats\n• ARM Cortex-M Embedded C Programming Udemy\n• D´eveloppement Embarqu´e avec STM32 Coursera\nExperience professionnelle\nAmpere Software Tunisie (Renault Group)\n04/2024 – Pr´esent\nIng´enieur Android Embarqu´e\nTunis, Tunisia\n• Planification, lancement et pilotage de campagnes compl`etes de tests d’acceptance fonctionnelle sur la plateforme\nAndroid Automotive OS (AAOS), dans le cadre du projet Software Defined Vehicle (SDV), afin de garantir la\nconformit´e des fonctionnalit´es embarqu´ees aux exigences techniques et utilisateurs.\n• Conception et d´eveloppement de tests automatis´es en Python `a l’aide de Catbox, un framework interne de test,\npermettant d’acc´el´erer significativement les cycles de validation logicielle et de r´eduire de 40% le temps global de\nv´erification des fonctionnalit´es critiques.\n• R´ealisation d’analyses avanc´ees des logs syst`eme (logcat, dmesg) afin d’identifier, reproduire et documenter les anomalies,\navec ouverture et suivi des tickets de bugs via JIRA, contribuant `a l’am´elioration continue de la stabilit´e du syst`eme.\n• Mise en place et gestion de l’int´egration continue des tests automatis´es via GitLab CI, d´eploy´es sur des environnements\nLinux embarqu´es, avec g´en´eration et diffusion de rapports de test automatis´es afin de garantir la tra¸cabilit´e et la\nr´eactivit´e face aux r´egressions.\nActia Engineering Services\n09/2022 – 03/2024\nD´eveloppeur Embarqu´e\nTunis, Tunisia\n• D´eveloppement d’une interface HMI embarqu´ee agissant en tant que client TCP, con¸cue avec le framework Qt,\npermettant la communication en temps r´eel avec des modules distants et l’affichage ergonomique des informations sur\nl’interface utilisateur.\n• Programmation bas niveau en langage C sur microcontrˆoleur STM32, avec int´egration du syst`eme temps r´eel\nFreeRTOS, gestion des communications via les protocoles SPI et UART, ainsi qu’optimisation des performances\nembarqu´ees pour r´epondre aux contraintes temps r´eel et de consommation ´energ´etique.\nAgil Carburant\n01/2022 – 06/2022\nStage de fin d’´etudes\nTunis, Tunisia\n• Conception et d´eveloppement d’un dashboard de supervision ´electrique avec Node-RED pour le site SNDP Rad`es,\nint´egrant la collecte, le traitement et le stockage des donn´ees IIoT issues de capteurs connect´es via LORA, MODBUS\net MQTT, avec une interface HMI intuitive pour la visualisation en temps r´eel et un syst`eme de gestion d’alarmes\nautomatis´ees pour le suivi proactif des incidents.\nComp´etences\nLangages de programmation: C/C++, Python, Java, Rust, QT, SQL\nFramework: Angular, Spring Boot, QT, Catbox, FreeRTOS, SPI, UART\nOutils , IDE: Git, JIRA, Confluence, GitLab, Eclipse, VS Code, STM32CubeIDE, Jenkins, Nexus, Jfrog\nEnvironnements: Windows, Linux\nLanguages\nFran¸cais: Level B2\nAnglais: Level B2\n"
    }
  ]
}